#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=3815fa70dfc2b5977404647d88c5fee152e1e091]
aws_kms_key.ebs: Refreshing state... [id=f4b7cd68-08f4-47c0-8727-cd187f24090a]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-west-1:294268556398:certificate/ca4273d6-ac62-4c10-8f2d-c336af54df53]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0724aacec3a49e2ef]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.assume_role: Reading...
aws_iam_role.this: Refreshing state... [id=ssm_role]
aws_route53_zone.public: Refreshing state... [id=Z02656311K1COJYMC68ZU]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=ssm_role-20230608162355474100000003]
aws_iam_role_policy_attachment.this[1]: Refreshing state... [id=ssm_role-20230608162355674900000004]
aws_iam_instance_profile.this: Refreshing state... [id=ssm_profile]
aws_route53_record.this["phpmyadmin.ashley.aws.crlabs.cloud"]: Refreshing state... [id=Z02656311K1COJYMC68ZU__7de4954a625e4597cbdea39929c99f11.phpmyadmin.ashley.aws.crlabs.cloud._CNAME]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_kms_alias.ebs: Refreshing state... [id=alias/ebs-key]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-06-09 10:02:08.283 +0000 UTC]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b864136fe2515278]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07e860a4e9b1952f2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04e047c82e4b29f98]
aws_security_group.replication: Refreshing state... [id=sg-02279af64ddb1237d]
aws_security_group.lb: Refreshing state... [id=sg-017f7acf0f506590e]
aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:targetgroup/phpmyadmin/3d5c61373b4a9a44]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07f01dd6ba48b2c99]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-09cd077178f2471d3]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c7e79b5053f7b08a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-069cf6d1ee014b306]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f1351f2645c43efa]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bf4d602239bbcbf8]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07be113b7f0c2a4b0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09bff2412d460c0b2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05dbcecc677b875de]
aws_security_group.pgadmin: Refreshing state... [id=sg-091bd3cfe36bef988]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a9dac1f9fc384e1b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07be113b7f0c2a4b01080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09cd2923d39db71e6]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-017843cb42e3d5986]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e786c6372babb348]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fab53f78d26c6008]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08b30fe318ef03b52]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-049ac44353ca9b830]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05b63a23358801b44]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:loadbalancer/app/migration-alb/086a6ea9fb865178]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bf4d602239bbcbf81080289494]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:listener/app/migration-alb/086a6ea9fb865178/832d2976f07580c0]
aws_route53_record.lb: Refreshing state... [id=Z02656311K1COJYMC68ZU_phpmyadmin.ashley.aws.crlabs.cloud_A]
aws_lb_listener_certificate.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:listener/app/migration-alb/086a6ea9fb865178/832d2976f07580c0_arn:aws:acm:eu-west-1:294268556398:certificate/ca4273d6-ac62-4c10-8f2d-c336af54df53]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_lambda_function.test_lambda will be created
  + resource "aws_lambda_function" "test_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./lambda/lambda_function_payload.zip"
      + function_name                  = "secrets_manager_rotation"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "s0ZY4DZe61OVO6JIgnUTW1Q2Owf7T9CnEOfoIAy+U2w="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ash-ley, Action: `pull_request`, Working Directory: ` migration/ `, Workflow: `Terraform Validation`*